Revit 2027 API
View.CropBoxActive Property
Whether or not the Crop Box/Region is active for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CropBoxActive { get; set; }
Public Property CropBoxActive As Boolean
	Get
	Set
public:
property bool CropBoxActive {
	bool get ();
	void set (bool value);
}
member CropBoxActive : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException | Thrown when getting this property, if the view is a template and cannot have a crop box applied.
InvalidOperationException | Thrown when setting this property, if the view is a template and cannot have a crop box applied.
Remarks
Identifies whether the crop region modifies the graphical appearance of elements in the view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace